In [1]:
import numpy as np
import pandas as pd


df = pd.DataFrame({"Age":[22,21,43,23,26],"Gender":['F','M','M','F','M']})
df

   Age Gender
0   22      F
1   21      M
2   43      M
3   23      F
4   26      M

In [2]:
df = df.assign(Salary=[20000,21000,30000,24000,32000])
df

   Age Gender  Salary
0   22      F   20000
1   21      M   21000
2   43      M   30000
3   23      F   24000
4   26      M   32000

In [3]:
df.insert(0,"S",['a','b','c','d','e'])
df

   S  Age Gender  Salary
0  a   22      F   20000
1  b   21      M   21000
2  c   43      M   30000
3  d   23      F   24000
4  e   26      M   32000

In [4]:
df = df.set_index('S')

In [5]:
df

   Age Gender  Salary
S
a   22      F   20000
b   21      M   21000
c   43      M   30000
d   23      F   24000
e   26      M   32000

**Dropping rows using drop()**
- Syntax :- df.drop(index = [list of index_row_names])
- Here, index row names not index row numbers

df = df.drop(index=['a'])    # dropping single row

In [6]:
df

   Age Gender  Salary
S
a   22      F   20000
b   21      M   21000
c   43      M   30000
d   23      F   24000
e   26      M   32000

In [7]:
df = df.drop(index=['b','c'])    # dropping multiple rows Here, index means index_row_names not index_row_numbers so we can't use index_numbers here.   

# or
# df.drop(index=['b','c'],inplace=True)
# # Here inplace=True ,means after performing drop operation storing in same object location i.e. df

# or
# df.drop(['b','c'],axis=0)

In [8]:
df

   Age Gender  Salary
S
a   22      F   20000
d   23      F   24000
e   26      M   32000

In [9]:
df = df.drop(index=[3,4])

KeyError: '[3, 4] not found in axis'

In [10]:
df

   Age Gender  Salary
S
a   22      F   20000
d   23      F   24000
e   26      M   32000

**Dropping columns using drop()**

- Syntax :- df.drop(columns = [list of index_column_names])     
- here column names not column index numbers

In [11]:
df = df.drop(columns=["Age"])    # Droping single column
df

# or 

# df.drop(columns=["Age"],inplace=True)     # Here inplace=True ,means after performing drop operation storing in same object location i.e. df

# or 

# df.drop(["Age"],axis=1)

  Gender  Salary
S
a      F   20000
d      F   24000
e      M   32000

In [12]:
df.drop(columns=["Gender","Salary"])   # Droping multiple columns

# or
# df.drop(["Gender","Salary],axis=1)

Empty DataFrame
Columns: []
Index: [a, d, e]